Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: Even though the canvas shows a specific device and orientation, it is important to create an adaptive interface—an interface that automatically adjusts so that it looks good on any device and in any orientation.
ja: キャンバスが特定のデバイスと方向を示すとしても、重要なのは適応インターフェイス — 自動的に適応することでそれがあらゆるデバイスであらゆる方向においてふさわしく見えるインターフェイス — を作成することです。

source: Even though you haven’t written any code, you can build and run the Single View Application template without any additional configuration.
ja: あなたが１つもコードを書かなかったとしても、あなたはSingle View Applicationひな形をビルドして実行することが、追加の何らかの構成なしにできます。

source: Eventually, you will use this button to change the meal’s rating; however, for now you’ll just check that the action is working.
ja: 最後には、あなたはこのボタンを使って食事の持つ格付けを変更します；しかしながら、今のところはあなたは単にアクションが働いているかを確認するだけです。

source: Every controller on the navigation stack gets a navigation bar, which can contain controls for backward and forward navigation.
ja: ナビゲーションスタック上のすべてのコントローラは、ナビゲーションバーを手に入れます、それは前後へのナビゲーションのためのコントロールを含むことができます。

source: Every time the app launches, it starts over with the initial sample data.
ja: アプリが起動するたびごとに、それは初期見本データで最初からやり直します。

source: Every time you launch the app, you start over with the initial sample data.
ja: あなたがアプリを起動するたびごとに、あなたは初期見本データで最初からやり直します。

source: Everything should work as before.
ja: すべてのものが前と同じに機能するはずです。

source: Everything should work exactly as before, but the Set Default Label Text button is gone, and the elements are centered horizontally.
ja: すべてのものが正確に以前と同じように働きます、しかしSet Default Label Textボタンはなくなりました、そして要素は水平方向の中心に置かれます。

source: Examples are “Adds a title” or “Opens the shopping list.”
ja: 例は、「タイトルを追加」や「買い物リストを開く」です。

source: Examples are “Add” or “Play.”
ja: 例は、「追加」や「再生」です。

source: Expand the Navigator area and open the Project navigator.
ja: Navigator区画を展開して、Projectナビゲータを開いてください。

source: Expand the project navigator and utility area by clicking the Navigator and Utilities buttons in the Xcode toolbar.
ja: プロジェクトナビゲータとユーティリティ区画をNavigatorとUtilitiesボタンをXcodeツールバーでクリックすることで広げてください。

source: Explain the relationship between a scene in a storyboard and the underlying view controller
ja: ストーリーボードの中のシーンとその下にあるビューコントローラの間の関係を明らかにする

source: Explore Further
ja: さらに先を探索

source: Failable initializers always start with either init? or init!.
ja: 失敗できるイニシャライザは、常にinit?またはinit!どちらかで始まります。

source: Fill out the basic implementation by setting the properties equal to the parameter values.
ja: 基本的な実装をプロパティをパラメータ値と等しく設定することで埋めてください。

source: Finally, add the button to the stack:
ja: 最後に、ボタンをスタックに加えてください：

source: Finally, assign these values to the accessibilityHint and accessibilityValue properties.
ja: 最後に、これらの値をaccessibilityHintとaccessibilityValueプロパティに割り当ててください。

source: Finally, it reads the accessibility hint (if any).
ja: 最後に、それはアクセシビリティヒントを読み上げます（もしあれば）。

source: Finally, once all the buttons have been removed, it clears the ratingButtons array.
ja: 最後に、一旦すべてのボタンが削除されてしまうならば、それはratingButtons配列を片付けます。

source: Finally, the system launches your app.
ja: 最終的に、システムはあなたのアプリを起動します。

source: Finally, you added a couple of unit tests to help you find and fix bugs in your code.
ja: 最後に、あなたは少数のユニットテストを加えて、あなたがあなたのコードでバグを見つけて修正する助けとしました。

source: Finally, you added accessibility information, ensuring that the control works well with Voice Over.
ja: 最後に、あなたはアクセシビリティ情報を加えて、コントロールがVoice Overでうまく機能することを確かなものにしました。

source: Finally, you set the highlighted image for both the highlighted and the selected and highlighted states.
ja: 最後に、あなたは強調画像を強調状態および選択・強調状態の両方に対して設定します。

source: Find the setupButtons() method:
ja: setupButtons()メソッドを見つけてください：

source: Find the viewDidLoad() method.
ja: viewDidLoad()メソッドを見つけてください：

source: Find the line that sets the background color (button.backgroundColor = UIColor.redColor()) and replace it with the following:
ja: 背景色を設定する行（button.backgroundColor = UIColor.redColor()）を見つけて、それを以下と置き換えてください：

source: First, ViewController needs to adopt the UIImagePickerControllerDelegate protocol.
ja: まず、ViewControllerに必要なのはUIImagePickerControllerDelegateプロトコルに準拠することです。

source: First, ViewController needs to adopt the UITextFieldDelegate protocol.
ja: まず、ViewControllerに必要なのはUITextFieldDelegateプロトコルに準拠することです。

source: First, create a custom table view controller subclass to manage the meal list scene.
ja: 最初に、食事リストシーンを管理するためのカスタムビューコントローラのサブクラスを作成します。

source: First, it removes the button from the list of views managed by the stack view.
ja: まず、それはボタンをスタックビューによって管理されるビューのリストから削除します。

source: First, take a look at the AppDelegate.swift file.
ja: 最初に、AppDelegate.swiftファイルを見てみましょう。

source: First, you need to connect the image view to the code in ViewController.swift.
ja: 最初に、あなたはが必要とするのはイメージビューをViewController.swiftの中のコードに接続することです。

source: First, you’ll put your table view controller inside of a navigation controller.
ja: 最初に、あなたは、あなたのテーブルビューコントローラを、あるナビゲーションコントローラの内部に置きます。

source: Follow the prompts through these screens until Xcode is completely set up and ready to launch.
ja: Xcodeが完全に設定されて起動準備ができるまでこれらの画面を進んでプロンプトに従ってください。

source: Follow the target-action pattern when designing app architecture
ja: アプリ構造を設計する時に「ターゲット-アクション」パターンに従う

source: For Name, type cancel.
ja: Nameに対して、cancelをタイプしてください。

source: For Name, type selectImageFromPhotoLibrary.
ja: Nameに対して、selectImageFromPhotoLibraryをタイプします。

source: For Name, type setDefaultLabelText.
ja: Nameに対して、setDefaultLabelTextをタイプします。

source: For Type, select UIBarButtonItem.
ja: Typeに対して、UIBarButtonItemを選択してください。

source: For Type, select UIButton.
ja: Typeに対して、UIButtonを選択します。

source: For Type, select UITapGestureRecognizer.
ja: Typeに対して、UITapGestureRecognizerを選択します。

source: For a class, structure, or enumeration to satisfy the requirements of a protocol.
ja: クラス、構造体、または列挙にとってプロトコルの要件を満たすこと。

source: For a simple table view like the one in the FoodTracker app, you just need the table view to display a single section, so the implementation of the numberOfSections(In:) data source method is straightforward.
ja: FoodTrackerアプリでのもののような単純なテーブルビューに対して、あなたは単に１つだけセクションを表示するテーブルビューを必要とします、それでnumberOfSections(In:)データソースメソッドの実装は単刀直入なものです。

source: For any given row in the table view, you configure the cell by fetching the corresponding Meal in the meals array, and then setting the cell’s properties to corresponding values from the Meal class.
ja: テーブルビュー中の任意の指定された行のために、あなたはセルを構成します、それはmeals配列の中の対応するMealを取ってきて、それからセルのプロパティをMealクラスからの対応する値に設定することで行います。

source: For example, a test that checks the Meal class’s initialization code could be named testMealInitialization.
ja: 例えば、Mealクラスの持つ初期化コードを調べるテストは、testMealInitializationと命名されることができます。

source: For example, if you have a 4-star rating, the value says “4 stars set.” Finally, you assign a hint to the currently selected star that says, “Tap to reset the rating to zero.” All the other stars have a nil-valued hint, because their effects are already adequately described by their labels.
ja: 例えば、あなたが星４格付けをするならば、その値は「星４を設定」と話します。最後に、あなたはあるヒントを現在選択される星に割り当てます、それは「タップして格付けをゼロにリセット」と話します。他の星すべては、nil値のヒントを持ちます、なぜならそれらの効果はすでにそれらのラベルによって妥当に解説されるからです。

source: For example, the first button’s label says “Set 1 star rating.” The accessibility value contains the control’s current rating.
ja: 例えば、最初のボタンの持つラベルは、「星１格付けを設定」と言います。アクセシビリティ値は、そのコントロールの持つ現在の格付けを含みます。

source: For example, the label for a slider might be “Speed,” but its current value might be “50%.”
ja: 例えば、あるスライダのためのラベルは「速度」であるかもしれません、しかしそれの現在の値は「50%」であるかもしれません。

source: For example, when the interface is rotated into a landscape orientation, the text field should grow.
ja: 例えば、インターフェイスが横方向へと回転される場合、テキスト欄は伸びるべきです。

source: For example, you can’t simply create an action method that’s triggered when a user taps on an image view.
ja: たとえば、あなたはユーザがイメージビューをタップするとき切り替えられるアクションメソッドを簡単には作成できません。

source: For example, you might use the key name to store the value of the name property.
ja: 例えば、あなたはキーnameを使うことで、nameプロパティの値を格納するかもしれません。

source: For information on adding inline sanity checks and preconditions to your code, see assert(_:_:file:line:) and precondition(_:_:file:line:).
ja: インライン正常性検査と事前条件をあなたのコードに加えること関する詳細として、assert(_:_:file:line:)とprecondition(_:_:file:line:)を見てください。

source: For more information on accessibility, see Accessibility on iOS.
ja: アクセシビリティに関する詳細として、Accessibility on iOSを見てください。

source: For more information on image resolutions, see Graphics > Image Size and Resolution in iOS Human Interface Guidelines.
ja: 画像解像度に関する詳細として、Graphics > Image SizeそしてResolutionをiOS Human Interface Guidelinesで見てください。

source: For more information on initializers, see Initialization.
ja: イニシャライザに関する詳細として、初期化を見てください。

source: For more information on interacting with the file system in iOS, see File System Programming Guide.
ja: iOSにおいてファイルシステムと相互作用することに関する詳細として、File System Programming Guideを見てください。

source: For more information on internationalization and localization, see Build Apps for the World.
ja: 国際化と現地語化に関する詳細として、Build Apps for the Worldを見てください。

source: For more information on possible info.plist keys, see Information Property List Key Reference.
ja: 可能なinfo.plistキーに関する詳細として、Information Property List Key Referenceを見てください。

source: For more information on the Swift initialization rules, see Class Inheritance and Initialization and Initialization in The Swift Programming Language (Swift 3.0.1).
ja: Swiftの初期化規則に関する詳細としてクラス継承と初期化と「初期化」をThe Swift Programming Language (Swift 3.0.1)で見てください。

source: For more information on the unified logging system, see Logging Reference.
ja: 統合ログシステムに関する詳細として、Logging Referenceを見てください。

source: For more information on working with custom views, see Lay out user interfaces > Add objects and media > Render custom views in Xcode help.
ja: カスタムビューを使っての作業の詳細として、Lay out user interfaces > Add objects and media > Render custom viewsをXcodeヘルプで見てください。

source: For more information, see Build Apps for the World.
ja: さらなる情報として、Build Apps for the Worldを見てください。

source: For more information, see Delegation in The Swift Programming Language (Swift 3.0.1).
ja: 詳細として、委任をThe Swift Programming Language (Swift 3.0.1)で見てください。

source: For more information, see Auto Layout Guide.
ja: 詳細として、Auto Layout Guideを見てください。

source: For more information, see Interaction > Modality and Interaction > Navigation in iOS Human Interface Guidelines.
ja: 詳細として、Interaction > Modality and Interaction > NavigationをiOS Human Interface Guidelinesで見てください。

source: For more information, select Help > Xcode Help and search for “Signing workflow.”
ja: さらなる情報として、Help > Xcode Helpを選択して“Signing workflow”を検索してください。

source: For navigation controllers, the show segue pushes new content on top of the current view controller stack.
ja: ナビゲーションコントローラに対して、表示セグエは現在のビューコントローラスタックの一番上に新しいコンテンツをプッシュします。

source: For now, scroll past all the template methods, and add the following code before the final closing brace (}):
ja: さしあたり、すべてのテンプレートメソッドを過ぎるまでスクロールして、以下のコードを最後の閉じ波括弧（}）の前に加えてください：

source: For now, you can preview your cell using the assistant editor.
ja: さしあたり、あなたはあなたのセルをアシスタントエディタを使ってプレビューします。

source: For now, you’ll need to implement two of these methods:
ja: さしあたり、あなたはそれらメソッドのうち２つを実装する必要があるでしょう：

source: For table views with a small number of rows, all rows may be onscreen at once, so this method gets called for each row in your table.
ja: 少ない数の行を持つテーブルビューに対しては、すべての行が一度に画面上にあることができます、それでこのメソッドはあなたのテーブルの中の各行に対して呼ばれることになります。

source: For the images to load properly in Interface Builder, you must explicitly specify the catalog’s bundle.
ja: 画像をInterface Builderにおいて適切にロードするために、あなたは明示的にカタログの持つバンドルを指定しなければなりません。

source: For the rating control, you need to provide three additional pieces of information for each button,
ja: 格付けコントロールのために、あなたは３つの追加的な部分の情報を各ボタンのために提供する必要があります、

source: For the rest of this lesson, just ignore it.
ja: このレッスンの残りでは、単にそれを無視します。

source: For this lesson, you’ll start with the most basic template: Single View Application.
ja: このレッスンでは、あなたは最も基本的なひな形：Single View Application（ビューが１つだけのアプリケーション）で始めます。

source: For this, you’ll implement the behavior of the Cancel button.
ja: これのために、あなたはCancelボタンの挙動を実装します。

source: For this, you’ll update the behavior of the Cancel button to dismiss the scene appropriately.
ja: このために、あなたはCancelボタンの挙動を更新して、そのシーンを適切に忘れ去られるようにします。

source: For this, you’ll use an image view (UIImageView), a user interface element that displays a picture.
ja: このために、あなたはイメージビュー（UIImageView）、画像を表示するユーザインターフェイス要素を使うことになります。

source: Fortunately, iOS comes with a built-in class, UITableView, designed specifically to display a scrolling list of items.
ja: 幸いにも、iOSは組み込みのクラス、スクロールできる項目のリストを表示するために特別に設計される、UITableViewを備えています。

source: Fortunately, it’s quite easy to give a view the same capabilities as a control by adding a gesture recognizer to it.
ja: 幸いなことに、ビューにコントロールと同じ能力を与えるのは、ジェスチャリコグナイザをそれに加えることによって比較的簡単です。

source: Fortunately, the UIImagePickerController class has this behavior built into it.
ja: 幸いにも、UIImagePickerControllerクラスは、この挙動をそれに組み込んでいます。

source: Functions menu
ja: 関数メニュー

source: Furthermore, because you are validating data before letting code execute, use guard statements.
ja: その上、あなたはコード実行を許可する前にデータを検証していることから、guard文を使ってください。

source: Furthermore, the subclass must mark their initializers as required, indicating that their subclasses must also implement the initializers.
ja: さらにその上、サブクラスはそれらのイニシャライザをrequiredと印して、それらのサブクラスもまたそれらイニシャライザを実装する必要があることを指し示さなければなりません。

source: Gesture recognizers interpret touches to determine whether they correspond to a specific gesture, such as a swipe, pinch, or rotation.
ja: ジェスチャリコグナイザは、タッチを解釈して、それが特定のジェスチャ、例えばスワイプ、ビンチ、または回転などに相当するか判断します。

source: Get Familiar with Xcode
ja: Xcodeに慣れる

source: Get the Tools
ja: ツールの入手

source: Getting Started
ja: はじめに

source: Glossary
ja: 用語集

source: Glossary terms are linked throughout the lessons.
ja: 用語集の用語は、レッスンのあちらこちらからリンクされます。

source: Go back and fix that.
ja: 戻ってそれを修正してください。

source: Go back to the the //MARK: UITextFieldDelegate section and find the textFieldDidEndEditing(_:) method:
ja: //MARK: UITextFieldDelegate節に戻ってtextFieldDidEndEditing(_:)メソッドを見つけてください：

source: Here are a few pointers on where to go from here:
ja: ここには、ここからどこへ行くかに関していくつかの助言があります：

source: Here are terms you will encounter throughout this guide.
ja: ここにあるのはこのガイドの至る所であなたが遭遇する用語です。

source: Here, the guard statements simply act as a sanity check.
ja: ここで、guard文は単純に正常性検査として振舞います。

source: Here, the operator unwraps the optional String returned by nameTextField.text (which is optional because there may or may not be text in the text field), and returns that value if it’s a valid string.
ja: ここで、この演算子は、nameTextField.text（これはオプショナルです、なぜならテキスト欄にテキストがあるかもしれないし無いかもしれないからです）によって返されるオプショナルのStringをアンラップします、そしてそれが有効な文字列ならばその値を返します。

source: Here, you are using one of the UIButton class’s convenience initializers.
ja: ここで、あなたはUIButtonクラスの持つ便宜イニシャライザの１つを使っています。

source: Here, you create the file URL by appending meals to the end of the documents URL.
ja: ここで、あなたはファイルURLをmealsを書類URLの終わりに加えることによって作成します。

source: Here, you define property observers for the starSize and starCount properties.
ja: ここで、あなたはプロパティオブザーバをstarSizeとstarCountプロパティに対して定義します。

source: Here, you start by checking whether the button is the currently selected button.
ja: ここでは、あなたはボタンが現在選択済ボタンかどうか調べることで始めます。

source: Here’s a breakdown:
ja: ここにはある断絶があります：

source: However, as long as the enumerations are correct, the returned array should always contain exactly one match.
ja: しかしながら、列挙が正しい間は、返される配列は常にきっちりマッチする１つを含むはずです。

source: However, because the control is @IBDesignable, the setup code also needs to run in Interface Builder.
ja: しかしながら、コントロールは@IBDesignableであることから、準備コードもまたInterface Builderにおいて動作する必要があります。

source: However, because the only buttons that trigger this action are the ones you created and added to the array, if the indexOf(_:) method cannot find a matching button, you have a serious bug in your code.
ja: しかしながら、このアクションを引き起こすボタンのみが、あなたが作成してこの配列に加えたものなので、indexOf(_:)メソッドが一致するボタンを見つけることができないならば、あなたはゆゆしいバグをあなたのコードの中に持ちます。

source: However, before you do that, you need to learn how to display a list of meals using a table view.
ja: しかしながら、あなたがそれをする前に、あなたは食事のリストをテーブルビューを使って表示する方法を学ぶ必要があります。

source: However, changing these values does not yet change the control.
ja: しかしながら、それらの値を変えることはまだコントロールを変えません。

source: However, if you later add another segue from your Your Meals scene and forget to update the prepare(for:sender:) method, the new segue’s identifier won’t match either the AddItem or the ShowDetail case.
ja: しかしながら、あなたが後で別のセグエをあなたのYour Mealsシーンから追加して、prepare(for:sender:)メソッドを更新するのを忘れるならば、新しいセグエの持つ識別子はAddItemまたはShowDetailケース節のどちらとも一致しないでしょう。

source: However, importing UIKit also gives you access to Foundation, so you can remove the redundant import to Foundation.
ja: しかしながら、UIKitをインポートすることはまたあなたにFoundationにアクセスさせます、それであなたはFoundationに対する冗長なインポートを取り除けます。

source: However, the didSet observers should only be called by Interface Builder at design time.
ja: しかしながら、didSetオブザーバは、Interface Builderによって設計時に一度だけ呼び出されるべきです。

source: However, the data is not saved.
ja: しかしながら、データは保存されません。

source: However, the scene on the canvas may not have the same dimensions as the simulator’s screen.
ja: しかしながら、キャンバス上のシーンはシミュレータの画面と同じ寸法を持たないでしょう。

source: However, the unified logging system gives you more control over when messages appear and how they are saved.
ja: しかしながら、統合ログシステムは、メッセージが現れる時とそれらが保存される方法のすべてに対してあなたにさらなる制御を行わせます。

source: However, this does not really tell you anything new.
ja: いずれにしても、これは実際あなたに何か変わったことを教えません。

source: However, when using Auto Layout, it’s a good habit to explicitly disable the autogenerated constraints whenever you programmatically create a view.
ja: しかしながら、「自動レイアウト」を使っている場合、あなたがプログラム的にビューを作成するたびごとに明示的に自動生成制約を作動しないようにするのは良い習慣です。

source: However, you want to keep the navigation bar to provide the user with visual continuity.
ja: しかしながら、あなたはナビゲーションバーを保持してユーザに視覚的整合性を提供することを望みます。

source: However, you will need to join the Apple Developer Program before you can submit your app to the App store.
ja: しかしながら、あなたがあなたのアプリをApp storeへ提出可能になる前に、あなたはApple Developer Programの一員になる必要があります。

source: Identify the purpose of key files that are created with an Xcode project template
ja: Xcodeプロジェクトテンプレートを使って作成されるキーファイル（主要ファイル）の用途を確認する

source: Identity inspector
ja: 同一性インスペクタ

source: If loadMeals() successfully returns an array of Meal objects, this condition is true and the if statement gets executed.
ja: loadMeals()が成功裏にMealオブジェクトの配列を返したならば、この条件はtrueになり、if文が実行されます。

source: If loadMeals() returns nil, there were no meals to load and the if statement doesn’t get executed.
ja: loadMeals()がnilを返すならば、ロードする食事はなかったので、if文は実行されません。

source: If a project window appears instead of the welcome window, don’t worry—you probably created or opened a project in Xcode previously.
ja: もしWelcomeウインドウではなくプロジェクトウインドウが現れても、心配いりません—あなたはおそらくXcoceで以前にプロジェクトを作成または開いたのでしょう。

source: If all of the commands are grayed out, select the scene’s view controller or one of the views and open the menu again.
ja: コマンドの全てがグレイアウトされるならば、シーンの持つビューコントローラまたはビューのうちの１つを選択して、メニューを再び開いてください。

source: If either of these operations fail, the entire initializer fails.
ja: これらの演算のどちらかかが失敗するならば、イニシャライザ全体が失敗します。

source: If either the downcast fails or the meal property on sourceViewController is nil, the condition evaluates to false and the if statement doesn’t get executed.
ja: ダウンキャストが失敗する、またはsourceViewController上のmealプロパティがnilである、このどちらでも、この条件はfalseに評価されてif文は実行されません。

source: If it does, it indicates a bug in your app.
ja: それが動作するならば、それはあなたのアプリの中のバグを指し示します。

source: If it is, that means a user tapped one of the table views cells to edit a meal.
ja: それがそうならば、ユーザがテーブルビューセルの１つをタップして、ある食事を編集することを意味します。

source: If it is, you assign a hint.
ja: そうであるならば、あなたはヒントを割り当てます。

source: If it was presented modally (the user tapped the Add button), it’ll be dismissed using dismissViewControllerAnimated(_:completion:).
ja: それがモーダルに提示された（ユーザがAddボタンをタップした）ならば、それはdismissViewControllerAnimated(_:completion:)を使って退去させられるでしょう。

source: If it was presented with push navigation (the user tapped a table view cell), it will be dismissed by the navigation controller that presented it.
ja: それがプッシュナビゲーションで表された（ユーザがテーブルピューセルをタップした）ならば、それはそれを表したナビゲーションコントローラによって退去させられます。

source: If necessary, click the text field to reveal the resize handles.
ja: 必要ならば、テキスト欄をクリックしてリサイズハンドル（寸法調節つまみ）が見えるようにしてください。

source: If necessary, in the Project navigator, drag the MealTableViewController.swift file so that it’s positioned with the other Swift files.
ja: 必要ならば、Projectナビゲータにおいて、MealTableViewController.swiftファイルをドラッグして、それでそれが他のSwiftファイルの下に置かれるようにします。

source: If necessary, in the Project navigator, drag the RatingControl.swift file so that it’s positioned under the other Swift files.
ja: 必要ならば、Projectナビゲータにおいて、RatingControl.swiftファイルをドラッグして、それでそれが他のSwiftファイルの下に置かれるようにします。

source: If necessary, open the FoodTracker folder in the project navigator by clicking the disclosure triangle next to it.
ja: 必要ならば、FoodTrackerフォルダをプロジェクトナビゲータにおいてその隣の開示三角形をクリックすることで開いてください。

source: If necessary, open the outline view.
ja: 必要なら、アウトラインビューを開いてください。

source: If necessary, run your app in the simulator.
ja: 必要なら、あなたのアプリをシミュレータにおいて実行してください。

source: If necessary, zoom in by choosing Editor > Canvas > Zoom.
ja: 必要ならば、Editor > Canvas > Zoomを選んで拡大します。

source: If no cells are available, dequeueReusableCell(withIdentifier:for:) instantiates a new one; however, as cells scroll off the scene, they are reused.
ja: セルが利用可能でないならば、dequeueReusableCell(withIdentifier:for:)は新しいものをインスタンス化します；しかしながら、セルがシーンの最後までスクロールされるとき、それらは再利用されます。

source: If not, it is positioned at the top of the scene.
ja: そうでないならば、それはシーンの一番上に置かれます。

source: If not, you set the button’s hintString property to nil.
ja: 違うならば、あなたはボタンのhintStringプロパティをnilに設定します。

source: If the meal property is non-nil, this code sets each of the views in MealViewController to display data from the meal property.
ja: mealプロパティが非nilならば、このコードはMealViewControllerの中のビューそれぞれをmealプロパティに設定します。

source: If the name parameter is an empty string, or if the rating parameter is less than 0 or greater than 5, this code assigns nil to the meal variable.
ja: nameパラメータが空文字列ならば、またはratingパラメータが0より小さいか5より大きいならば、このコードはnilをmeal変数に割り当てます。

source: If the meal property is non-nil, the code assigns the value of that property to the local constant meal and executes the if statement.
ja: mealプロパティが非nilならば、コードはそのプロパティの値をローカル定数mealに割り当ててif文を実行します。

source: If the assistant editor is open, return to the standard editor by clicking the Standard button.
ja: アシスタントエディタが開いているならば、標準エディタにStandardボタンをクリックすることで戻ってください。

source: If the button’s index is less than the rating, the isSelected property is set to true, and the button displays the filled-in star image.
ja: ボタンのインデックスが格付けより小さいならば、isSelectedプロパティはtrueへ設定されます、そしてボタンは塗りつぶされた星画像を表示します。

source: If the condition is false, the guard statement’s else branch must exit the current code block (for example, by calling return, break, continue, throw, or a method that doesn’t return like fatalError(_:file:line:)).
ja: その条件がfalseならば、guard文の持つelse分岐が現在のコードブロックを抜け出さなければなりません（例えば、return、break、continue、throw、またはfatalError(_:file:line:)のように返らないメソッドを呼ぶことによって）。

source: If the downcast does fail, the fatalError() function prints an error message to the console and terminates the app.
ja: ダウンキャストが失敗するならば、fatalError()関数はエラーメッセージをコンソールに出力してアプリを終了します。

source: If the downcast fails, it assigns nil to the photo property.
ja: ダウンキャストが失敗するならば、それはnilをphotoプロパティに割り当てます。

source: If the downcast succeeds, the code assigns the MealViewController instance to the local constant sourceViewController, and checks to see if the meal property on sourceViewController is nil.
ja: ダウンキャストが成功したならば、コードはMealViewControllerインスタンスをローカル定数のsourceViewControllerに割り当てます、そしてsourceViewControllerでのmealプロパティがnilかどうかを確認します。
